In [169]:
import pandas as pd
import numpy as np

In [6]:
# 500개의 값을 갖는 시리즈 생성
nums = pd.Series(range(500))      # nums '...'이란 표시가 존재하고 값이 생략되었음을 의미
nums

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

In [5]:
# 앞의 데이터를 추출해볼 때 사용할 수 있는 메서드 head()
nums.head(10)                                     # 디폴트 값은 5

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [7]:
# 뒤에서부터 데이터를 추출 tail() 디폴트 값 5
nums.tail(10)

490    490
491    491
492    492
493    493
494    494
495    495
496    496
497    497
498    498
499    499
dtype: int64

In [9]:
# Series 수학 연산   , np.nan의 데이터는 float형식
nums = pd.Series([1, 2, np.nan, 4, 5])
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [10]:
hello = pd.Series(list("hello"))
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [12]:
# nunique() 메서드는 고유한 값의 개수를 계산할 때 사용, 겹치는 값은 하나로 계산
hello.nunique()                                            # 종류

4

In [13]:
# count() 메서드는 데이터의 개수를 계산 nan 값은 개수에 포함x
nums.count()

4

In [15]:
len(nums)   # len()은 nan값도 개수에 포함

5

In [16]:
nums.sum()

12.0

In [17]:
nums.sum(skipna=False)  # skipha 파라미터는 기본 값이 True이기 때문에 False 값을 주면 nan 출력

nan

In [21]:
nums.mean(), nums.median(), nums.std() # 평균 중앙값 분산값

(3.0, 3.0, 1.8257418583505538)

In [22]:
nums.max(), nums.min()   # 가장 큰 값, 가장 작은 값

(5.0, 1.0)

In [27]:
somechar = pd.Series(list("AaBbCc")) # Series 값이 문자인 경우도 최대값과 최소값을 구할 수 있다.
somechar
somechar.max(), somechar.min()

('c', 'A')

In [30]:
# ord() 함수는 하나의 문자를 unicode 숫자로 변경 그 크기를 가지고 값 비교
ord('c'), ord('a'), ord('b')

(99, 97, 98)

In [31]:
#count, mean, std, min ,25%, median, 75%, max에 대한 모든 통계를 구해줌: describe()메서드
nums.describe()

count    4.000000
mean     3.000000
std      1.825742
min      1.000000
25%      1.750000
50%      3.000000
75%      4.250000
max      5.000000
dtype: float64

In [33]:
hello.describe()  # object값은 최빈 값 top, 최빈 값의 빈도 freq

count     5
unique    4
top       l
freq      2
dtype: object

In [34]:
# Series를 list와 dict로 바꾸기
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [37]:
list(nums)   #series의 객체를 list의 객체로 변경

[1.0, 2.0, nan, 4.0, 5.0]

In [36]:
dict(nums) #index는 key가 되고 values는 values가 됨

{0: 1.0, 1: 2.0, 2: nan, 3: 4.0, 4: 5.0}

In [40]:
superheros = [
    "Batman",
    "Superman",
    "Spider-Man",
    "Iron Man",
    "Captain America",
    "Wonder Woman"
]
strength_levels = (100, 120, 90, 95, 110, 120)
x = pd.Series(strength_levels,superheros)
x

Batman             100
Superman           120
Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [42]:
x.tail(4)

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [44]:
x[2:]

Spider-Man          90
Iron Man            95
Captain America    110
Wonder Woman       120
dtype: int64

In [45]:
x.nunique()

5

In [46]:
x.describe()

count      6.000000
mean     105.833333
std       12.812754
min       90.000000
25%       96.250000
50%      105.000000
75%      117.500000
max      120.000000
dtype: float64

In [48]:
x.mean(), x.median(), x.max(), x.min()

(105.83333333333333, 105.0, 120, 90)

In [49]:
dict(x)

{'Batman': 100,
 'Superman': 120,
 'Spider-Man': 90,
 'Iron Man': 95,
 'Captain America': 110,
 'Wonder Woman': 120}

In [ ]:
# pandas 데이터 입출력 : 데이터 파일을 읽어 Series 혹은 DataFrame을 만들 수 있다
CSV(Comman Separated Value)포맷 입출력 : 콤마로 구분되는 텍스트파일

In [69]:
# squeeze 매개변수는 하나의 열을 갖는 DataFrame을 Series로 변환
# index_col을 index로 사용하기 위해 column으로 지정
import pandas as pd
import numpy as np
Pokemons = pd.read_csv("datas/pokemon.csv", index_col="Pokemon").squeeze("columns")
Pokemons

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [71]:
Pokemons.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [72]:
#Series의 값 정렬하기 : sort_values()메서드

Pokemons.sort_values()

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [74]:
#반대로 정렬하기  메서드에 키워드 인자 ascending에 값을 False로 전달한다.

Pokemons.sort_values(ascending=False)

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [132]:
#parse_dates: 파싱할 데이터 바꿔줌?
google = pd.read_csv("datas/google_stocks.csv",
                parse_dates=["Date"],
                index_col="Date").squeeze("columns")
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [89]:
war = pd.read_csv("datas/revolutionary_war.csv",
                  parse_dates=["Start Date"],
                  index_col="Start Date",
                  usecols=["Start Date","State"]).squeeze("columns")
war

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [92]:
war.describe()

count                162
unique                17
top       South Carolina
freq                  31
Name: State, dtype: object

In [98]:
war.isnull().sum(), war.count(), war.nunique()

(70, 162, 17)

In [99]:
war.notnull().sum()

162

In [100]:
# sort_values에서 nan값을 정렬할때 키워드 인자 na_position="first"를 쓴다

war.sort_values(na_position="first")

Start Date
1775-09-17         NaN
1775-12-31         NaN
1776-03-03         NaN
1776-03-25         NaN
1776-05-18         NaN
                ...
1781-07-06    Virginia
1781-07-01    Virginia
1781-06-26    Virginia
1781-04-25    Virginia
1783-01-22    Virginia
Name: State, Length: 232, dtype: object

In [101]:
war.sort_values(na_position="last")

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [102]:
# Series의 값 중 nan 배제하기 : dropna()

war.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [106]:
# Series의 index를 기준으로 정렬

Pokemons.sort_index(ascending=True)  # 큰거 부터 정렬

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [107]:
Pokemons.sort_index(ascending=False) # 작은거 부터 정렬

Pokemon
Zygarde      Dragon / Ground
Zweilous       Dark / Dragon
Zubat        Poison / Flying
Zorua                   Dark
Zoroark                 Dark
                  ...
Aegislash      Steel / Ghost
Accelgor                 Bug
Absol                   Dark
Abra                 Psychic
Abomasnow        Grass / Ice
Name: Type, Length: 809, dtype: object

In [108]:
war.sort_index() # NaT: float인 반면 NaT는 날짜/시간 유형의 데이터이다

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [109]:
war.sort_index(na_position="first")

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [110]:
war.sort_index(na_position="last")

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [111]:
# Series의 index에 NaT 배제

war.loc[war.index.dropna()]   # dropna()를 쓰려면 index의 중복이 없어야 한다.

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [112]:
war.loc[war.index.notnull()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [126]:
google.sort_values()

Date
2004-09-03      49.82
2004-09-01      49.94
2004-08-19      49.98
2004-09-02      50.57
2004-09-07      50.60
               ...
2019-04-23    1264.55
2019-10-25    1265.13
2018-07-26    1268.33
2019-04-26    1272.18
2019-04-29    1287.58
Name: Close, Length: 3824, dtype: float64

In [124]:
google.sort_values(ascending=False).head(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [125]:
google.sort_values().head(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [127]:
war.index.value_counts()[:11]

1781-04-25    2
1781-05-22    2
1780-08-18    2
1781-09-13    2
1782-03-16    2
1780-05-25    2
1778-09-07    2
1782-01-11    2
1777-08-22    2
1775-04-19    2
1781-04-15    2
Name: Start Date, dtype: int64

In [134]:
# 앞서 구한 값을 메서드로 구할 수 있다: nlargest()
google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [135]:
google.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [136]:
# Series value_counts()메서드 :  데이터의 고유한 값의 빈도를 볼 때 활용
Pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [137]:
google.describe()

count    3824.000000
mean      479.945860
std       328.528592
min        49.820000
25%       235.860000
50%       314.680000
75%       708.205000
max      1287.580000
Name: Close, dtype: float64

In [138]:
bins = np.linspace(0,1400,8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [139]:
google.value_counts(bins=bins) 
# Series에 대해서 범주를 나눠 값의 빈도를 확인할 수 있다
# bins인수에 값의 구간을 갖는 리스트를 넘겨주면 된다. 
# 리스트의 모든 인접한 쌍을 각구간의 하한, 상한값으로 사용

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [151]:
bins = np.linspace(0,1400,8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [152]:
google.value_counts(bins=bins).sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [155]:
# 범주를 정수로 전달하면 그 정수만큼 알아서 구간을 나눕니다.
google.value_counts(bins=8, sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [158]:
data={
    'c1' : [1,2,'누락'],
    'c2' : [1.11,'',3.33],
    'c3' : ['one','two','three']
}
x = pd.DataFrame(data)
x

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [165]:
# pandas 데이터 csv로 출력하기 : 데이터를 csv파일로 출력할 땐 to_csv()메서드를 활용

x.to_csv("datas/sample1.csv", index=False)

In [166]:
%pwd

'C:\\python'

In [167]:
%cd C:\\python\\datas

C:\python\datas

In [ ]:
#pandas csv로부터 데이터 입력하기
pd.read_csv()   # ,*,옆으로 오는 것은 키워드로 쓰는 것

In [173]:
df_read = pd.read_csv("sample1.csv")
df_read  # row 인덱스 정보가 없으므로 0부터 함

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [178]:
%pwd

'C:\\python\\datas'

In [176]:
%cd

C:\Users\jaehee

In [183]:
%pwd

'C:\\python\\datas'

In [184]:
# Pandas 데이터 csv로 출력하기
# column 인덱스를 배제하고 저장

x.to_csv("sample2.csv",index=False, header=False)

In [186]:
d=pd.read_csv('sample2.csv', names=['c1','c2','c3'])
d    #columns index가 없을때는 name 키워드 인자를 사용하여 사용

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [187]:
%%writefile sample3.txt      # 매직 명령어인 %%writefile 파일명 을 사용하여 저장할 수 있다.
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [188]:
a = pd.read_table('sample3.txt', sep = '\s+')
a    # 데이터를 구분하는 구분자가 콤마가 아니면 sep인수를 써서 구분자를 사용자가 지정해줘야 한다.
     # 길이가 정해지지 않은 공백이 구분자인 경우에 '\s+'정규식 문자열을 사용합니다.

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [189]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [190]:
b = pd.read_table('sample4.txt', skiprows=[0,1])
b      # 데이터를 불러올 자료 중에 건너 뛰어야 할 상단 행이 있으면 skiprows을 사용

       c1, c2, c3
0    1, 1.11, one
1    2, 2.22, two
2  3, 3.33, three

In [192]:
c = pd.read_table('sample4.txt', skiprows=range(2))
c

       c1, c2, c3
0    1, 1.11, one
1    2, 2.22, two
2  3, 3.33, three

In [ ]:
# 데이터로 불러올 자료 안 특정한 값을 NaN으로 
# 취급하고 싶다면 na_values인수에 NaN 값으로 취급할 값을 넣는다.

In [194]:
df_na_val = pd.read_csv('sample1.csv', na_values=['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [195]:
df_na_val.to_csv('sample5.txt',sep='|')

In [196]:
df_na_val.to_csv('sample6.csv', na_rep="누락")

In [197]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [198]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [199]:
titanic.head(20) # tail()메서드 사용

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y
10,0,male,39.0,1,5,31.2750,Third,unknown,Southampton,n
11,0,female,14.0,0,0,7.8542,Third,unknown,Southampton,y
12,0,male,2.0,4,1,29.1250,Third,unknown,Queenstown,n
13,1,male,28.0,0,0,13.0000,Second,unknown,Southampton,y
14,0,female,31.0,1,0,18.0000,Third,unknown,Southampton,n
15,1,female,28.0,0,0,7.2250,Third,unknown,Cherbourg,y
16,0,male,35.0,0,0,26.0000,Second,unknown,Southampton,y
17,1,male,28.0,0,0,35.5000,First,A,Southampton,y
18,1,female,38.0,1,5,31.3875,Third,unknown,Southampton,n
19,0,male,28.0,0,0,7.2250,Third,unknown,Cherbourg,y

In [202]:
# bmi 파일
a=pd.read_csv("https://blog.kakaocdn.net/dn/bzNWe6/btrdpLD2Fu6/tRnRNyptPUOCwptW4K5TTK/bmi_500.csv?attach=1&knm=tfile.csv")
a  # csv 파일 깨지면 (,encoding="cp949")쓴다.

     Gender  Height  Weight            Label
0      Male     174      96          Obesity
1      Male     189      87           Normal
2    Female     185     110          Obesity
3    Female     195     104       Overweight
4      Male     149      61       Overweight
..      ...     ...     ...              ...
495  Female     150     153  Extreme Obesity
496  Female     184     121          Obesity
497  Female     141     136  Extreme Obesity
498    Male     150      95  Extreme Obesity
499    Male     173     131  Extreme Obesity

[500 rows x 4 columns]

In [203]:
b = pd.read_csv("https://blog.kakaocdn.net/dn/yH7cd/btqT19bdTXb/OvDQM98eNA0sOr8JxK734K/auto-mpg.csv?attach=1&knm=tfile.csv")
b

     18.0  8  307.0  130.0   3504.  12.0  70  1 chevrolet chevelle malibu
0    15.0  8  350.0  165.0  3693.0  11.5  70  1         buick skylark 320
1    18.0  8  318.0  150.0  3436.0  11.0  70  1        plymouth satellite
2    16.0  8  304.0  150.0  3433.0  12.0  70  1             amc rebel sst
3    17.0  8  302.0  140.0  3449.0  10.5  70  1               ford torino
4    15.0  8  429.0  198.0  4341.0  10.0  70  1          ford galaxie 500
..    ... ..    ...    ...     ...   ...  .. ..                       ...
392  27.0  4  140.0  86.00  2790.0  15.6  82  1           ford mustang gl
393  44.0  4   97.0  52.00  2130.0  24.6  82  2                 vw pickup
394  32.0  4  135.0  84.00  2295.0  11.6  82  1             dodge rampage
395  28.0  4  120.0  79.00  2625.0  18.6  82  1               ford ranger
396  31.0  4  119.0  82.00  2720.0  19.4  82  1                chevy s-10

[397 rows x 9 columns]